Пансион83/src/Catalogs/Услуги/Услуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Услуги</name>
  <comment>Услуги</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>DescriptionTranslations</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>GroupByDescriptionTranslations</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Unit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UnitTranslations</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>GetUnitFromRule</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AllowChangePrice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RecalculatePriceWhenSumChanged</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>QuantityCalculationRule</name>
    <type>
      <types>CatalogRef.ПравилаНачисленияКоличестваУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>IsRoomRevenue</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RoomRevenueAmountsOnly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsInPrice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsResourceRevenue</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DoNotGroupIntoRoomRateOnPrint</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SplitToSeparateSettlements</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DoNotExportToTheAccountingSystem</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ServiceRegistrationIsTurnedOn</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>MaxOneServicePerDayIsAllowed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ExternalCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServiceType</name>
    <type>
      <types>CatalogRef.ТипыУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentSection</name>
    <type>
      <types>CatalogRef.ОтделОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ChargePerPerson</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsStockArticle</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsAgentService</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsHotelProductService</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsPricePerMinute</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ResourceType</name>
    <type>
      <types>CatalogRef.ТипыРесурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>Resource</name>
    <type>
      <types>CatalogRef.Ресурсы</types>
    </type>
  </attributes>
  <attributes>
    <name>SortCode</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Remarks</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Composition</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>HideIntoServiceOnPrint</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>BoundService</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </attributes>
  <attributes>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>IsGiftCertificate</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>BarCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AvailableQuantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ServiceItems</name>
    <attributes>
      <name>ServiceItem</name>
      <type>
        <types>CatalogRef.ПозицииМеню</types>
      </type>
    </attributes>
    <attributes>
      <name>Output</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>7</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ReplacementIndex</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Пансион83/src/InformationRegisters/ХарактеристикаУслуг/ХарактеристикаУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХарактеристикаУслуг</name>
  <resources>
    <name>ServiceCharacteristicValue</name>
    <type>
      <types>Characteristic.ВидыХарактеристикУслуг</types>
    </type>
  </resources>
  <dimensions>
    <name>Service</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ServiceCharacteristic</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыХарактеристикУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Пансион83/src/Catalogs/ЕдИзмерения/ЕдИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЕдИзмерения</name>
  <predefined>
    <items>
      <name>Gram</name>
      <description>г.</description>
    </items>
    <items>
      <name>Kilogram</name>
      <description>кг.</description>
    </items>
    <items>
      <name>Litre</name>
      <description>л.</description>
    </items>
    <items>
      <name>Megabyte</name>
      <description>мбайт.</description>
    </items>
    <items>
      <name>Minute</name>
      <description>мин.</description>
    </items>
    <items>
      <name>Mililitre</name>
      <description>мл.</description>
    </items>
    <items>
      <name>Night</name>
      <description>сут.</description>
    </items>
    <items>
      <name>Pack</name>
      <description>упак.</description>
    </items>
    <items>
      <name>Hour</name>
      <description>ч.</description>
    </items>
    <items>
      <name>Man</name>
      <description>чел.</description>
    </items>
    <items>
      <name>ManDay</name>
      <description>чел. дн.</description>
    </items>
    <items>
      <name>Piece</name>
      <description>шт.</description>
    </items>
  </predefined>
</mdclass:Catalog>

Пансион83/src/Catalogs/Услуги/ObjectModule.bsl
//-----------------------------------------------------------------------------
Function pmGetServiceDescription(pLang, pUseGroupByDescription = False) Экспорт
	vDescr = "";
	If НЕ ЗначениеЗаполнено(pLang) Тогда
		vDescr = СокрЛП(Description);
	Else
		If pUseGroupByDescription And НЕ IsBlankString(GroupByDescriptionTranslations) Тогда
			vDescr = СокрЛП(GroupByDescriptionTranslations);
		Else
			If IsBlankString(DescriptionTranslations) Тогда
				vDescr = СокрЛП(Description);
			Else
				vDescr = СокрЛП(DescriptionTranslations);
			EndIf;
		EndIf;
	EndIf;
	Return vDescr;
EndFunction //pmGetServiceDescription

//-----------------------------------------------------------------------------
Function pmGetServiceUnitDescription(pLang) Экспорт
	vDescr = "";
	If НЕ ЗначениеЗаполнено(pLang) Тогда
		vDescr = СокрЛП(Unit);
	Else
		If IsBlankString(UnitTranslations) Тогда
			vDescr = СокрЛП(Unit);
		Else
			vDescr = СокрЛП(UnitTranslations);
		EndIf;
	EndIf;
	Return vDescr;
EndFunction //pmGetServiceUnitDescription

//-----------------------------------------------------------------------------
Function pmGetServiceQuantityPresentation(pQuantity, pLang) Экспорт
	vQuantityStr = "";
	If Round(pQuantity, 3) <> pQuantity Тогда
		vQuantityStr = ?(pQuantity = 0, "", Format(pQuantity, "ND=17; NFD=3"));
	Else
		vQuantityStr = ?(pQuantity = 0, "", String(pQuantity));
	EndIf;
	vQuantityStr = СокрЛП(vQuantityStr + " " + pmGetServiceUnitDescription(pLang));
	If GetUnitFromRule And ЗначениеЗаполнено(QuantityCalculationRule) Тогда
		If QuantityCalculationRule.PeriodInHours = 24 Тогда
			vQuantityInHours = Round(pQuantity * QuantityCalculationRule.PeriodInHours);
			vQuantityInDays = Int(vQuantityInHours/24);
			vQuantityInHours = vQuantityInHours - vQuantityInDays*24;
			If vQuantityInDays <> 0 Тогда
				vQuantityStr = String(vQuantityInDays) + " " + pmGetServiceUnitDescription(pLang) + " ";
			Else
				vQuantityStr = "";
			EndIf;
			If vQuantityInHours <> 0 Тогда
				vQuantityStr = vQuantityStr + String(vQuantityInHours) + " ч";
			EndIf;
		EndIf;
	ElsIf IsResourceRevenue And НЕ RoomRevenueAmountsOnly Тогда
		If IsPricePerMinute And СокрЛП(Unit) = СокрЛП(Справочники.ЕдИзмерения.Minute) Тогда
			vQuantityStr = String(pQuantity) + " м";
		ElsIf СокрЛП(Unit) = СокрЛП(Справочники.ЕдИзмерения.Hour) Тогда
			vQuantityInHours = Int(pQuantity);
			vQuantityInMinutes = Round((pQuantity - Int(pQuantity))*60, 0);
			If vQuantityInHours <> 0 Тогда
				vQuantityStr = String(vQuantityInHours) + " ч ";
			Else
				vQuantityStr = "";
			EndIf;
			If vQuantityInMinutes <> 0 Тогда
				vQuantityStr = vQuantityStr + String(vQuantityInMinutes) + " м";
			EndIf;
		EndIf;
	EndIf;
	Return vQuantityStr;
EndFunction //pmGetServiceQuantityPresentation	

//-----------------------------------------------------------------------------
Function pmGetServicePrices(pHotel, pDate = Неопределено, pClientType = Неопределено) Экспорт
	// Common checks	
	If НЕ ЗначениеЗаполнено(pHotel) Тогда
		ВызватьИсключение(NStr("en='ERR: Error calling Service.pmGetServicePrices function.
		               |CAUSE: Empty pHotel parameter value was passed to the function.
					   |DESC: Mandatory parameter pHotel should be filled.';
				   |ru='ERR: Ошибка вызова функции Service.pmGetServicePrices.
					   |CAUSE: В функцию передано пустое значение параметра pHotel.
					   |DESC: Обязательный параметр pHotel должен быть явно указан.';
				   |de='ERR: Fehler beim Aufruf der Funktion cmGetServicePrices.
				       |CAUSE: In die Funktion wurde ein leerer Wert des Parameters pHotel übertragen.
					   |DESC: Das Pflichtparameter pHotel muss eindeutig angegeben sein.'"));
	EndIf;
	
	// Fill parameters default values 
	If НЕ ЗначениеЗаполнено(pDate) Тогда
		pDate = CurrentDate();
	EndIf;
	If НЕ ЗначениеЗаполнено(pClientType) Тогда
		pClientType = Справочники.ТипыКлиентов.EmptyRef();
	EndIf;
	
	// Build and run query
	qGetPrices = New Query();
	qGetPrices.Text = 
	"SELECT
	|	ServicePrices.Period,
	|	ServicePrices.Гостиница,
	|	ServicePrices.Услуга,
	|	ServicePrices.ТипКлиента,
	|	ServicePrices.Цена,
	|	ServicePrices.Валюта,
	|	ServicePrices.СтавкаНДС
	|FROM
	|	InformationRegister.ServicePrices.SliceLast(
	|			&qDate,
	|			Гостиница = &qHotel
	|				AND Услуга = &qService
	|				AND ТипКлиента = &qClientType) AS ServicePrices";
	qGetPrices.SetParameter("qDate", pDate);
	qGetPrices.SetParameter("qHotel", pHotel);
	qGetPrices.SetParameter("qService", Ref);
	qGetPrices.SetParameter("qClientType", pClientType);
	vPrices = qGetPrices.Execute().Unload();
	
	If vPrices.Count() = 0 And ЗначениеЗаполнено(pClientType) Тогда
		// Build and run query
		qGetPrices = New Query();
		qGetPrices.Text = 
		"SELECT
		|	ServicePrices.Period,
		|	ServicePrices.Гостиница,
		|	ServicePrices.Услуга,
		|	ServicePrices.ТипКлиента,
		|	ServicePrices.Цена,
		|	ServicePrices.Валюта,
		|	ServicePrices.СтавкаНДС
		|FROM
		|	InformationRegister.ServicePrices.SliceLast(
		|			&qDate,
		|			Гостиница = &qHotel
		|				AND Услуга = &qService
		|				AND ТипКлиента = &qEmptyClientType) AS ServicePrices";
		qGetPrices.SetParameter("qDate", pDate);
		qGetPrices.SetParameter("qHotel", pHotel);
		qGetPrices.SetParameter("qService", Ref);
		qGetPrices.SetParameter("qEmptyClientType", Справочники.ТипыКлиентов.EmptyRef());
		vPrices = qGetPrices.Execute().Unload();
	EndIf;
	
	Return vPrices;
EndFunction //pmGetServicePrices

//-----------------------------------------------------------------------------
Процедура OnCopy(pCopiedObject)
	If НЕ IsFolder Тогда
		ExternalCode = "";
	EndIf;
КонецПроцедуры //OnCopy

//-----------------------------------------------------------------------------
// Get service characteristics
// Returns ValueTable 
//-----------------------------------------------------------------------------
Function pmGetServiceCharacteristics() Экспорт
	// Build and run query
	vQry = New Query;
	vQry.Text = 
	"SELECT
	|	ServiceCharacteristics.Услуга,
	|	ServiceCharacteristics.ServiceCharacteristic,
	|	ServiceCharacteristics.ServiceCharacteristicValue
	|FROM
	|	InformationRegister.ServiceCharacteristics AS ServiceCharacteristics
	|WHERE
	|	ServiceCharacteristics.Услуга = &qService AND
	|	ServiceCharacteristics.ServiceCharacteristic.DeletionMark = FALSE
	|ORDER BY
	|	ServiceCharacteristics.ServiceCharacteristic.Code";
	vQry.SetParameter("qService", Ref);
	vChars = vQry.Execute().Unload();
	Return vChars;
EndFunction //pmGetServiceCharacteristics

//-----------------------------------------------------------------------------
// Get service characteristic value
// Returns Value
//-----------------------------------------------------------------------------
Function pmGetServiceCharacteristicValue(pServiceCharacteristic) Экспорт
	vCharValue = Неопределено;
	// Build and run query
	vQry = New Query;
	vQry.Text = 
	"SELECT
	|	ServiceCharacteristics.ServiceCharacteristicValue
	|FROM
	|	InformationRegister.ServiceCharacteristics AS ServiceCharacteristics
	|WHERE
	|	ServiceCharacteristics.Услуга = &qService AND
	|	ServiceCharacteristics.ServiceCharacteristic = &qServiceCharacteristic
	|ORDER BY
	|	ServiceCharacteristics.ServiceCharacteristic.Code";
	vQry.SetParameter("qService", Ref);
	vQry.SetParameter("qServiceCharacteristic", pServiceCharacteristic);
	vChars = vQry.Execute().Choose();
	While vChars.Next() Do
		vCharValue = vChars.ServiceCharacteristicValue;
		Break;
	EndDo;
	Return vCharValue;
EndFunction //pmGetServiceCharacteristicValue

//-----------------------------------------------------------------------------
Процедура pmSaveServiceCharacteristicValue(pServiceCharacteristic, pServiceCharacteristicValue) Экспорт
	vServiceCharsMgr = InformationRegisters.ХарактеристикаУслуг.CreateRecordManager();
	vServiceCharsMgr.Услуга = Ref;
	vServiceCharsMgr.ServiceCharacteristic = pServiceCharacteristic;
	vServiceCharsMgr.Read();
	If vServiceCharsMgr.Selected() Тогда
		vServiceCharsMgr.Услуга = Ref;
		vServiceCharsMgr.ServiceCharacteristic = pServiceCharacteristic;
		vServiceCharsMgr.ServiceCharacteristicValue = pServiceCharacteristicValue;
		vServiceCharsMgr.Write();
	EndIf;
КонецПроцедуры //pmSaveServiceCharacteristicValue
